'''
@Project ：code 
@File    ：prompt_manager.py
@Author  ：Sito
@Date    ：2025/3/4 14:02 
@Description    ：
'''
import json

deny_words = ['未明确','未提及','没有']

level_label = {
    "A. 年轻人生活状态探讨": {
        "1、受访者": {
            "序号": "",
            "城市": "",
            "受访者": "",
            "核心发现": ""
        },
        "2、产品信息": {
            "品牌": "",
            "价格": ""
        },
        "3、基本信息": {
            "性别": "",
            "年龄": "",
            "行业及职业": "",
            "家庭结构": "",
            "孩子情况": "",
            "家庭年收入": "",
            "房屋类型": "",
            "房屋面积": "",
            "家庭成员及组成": ""
        },
        "4、兴趣爱好": {
            "工作节奏": "",
            "生活重心": "",
            "个人喜好": ""
        },
        "5、特殊衣物": {
            "特殊衣物洞察": ""
        },
        "6、家务态度": {
            "家务态度": ""
        },
        "7、年轻人消费": {
            "个人消费": "",
            "家庭消费": ""
        },
        "8、居住特征": {
            "房子情况": "",
            "家装风格": "",
            "家电盘点": "",
            "家电智能化程度": "",
            "洗涤设备": ""
        },
        "9、家电需求": {
            "家电消费观": "",
            "家电嵌入式需求": ""
        },
        "10、触媒习惯": {
            "触媒渠道": ""
        },
        "11、购买产品的背景及动机": {
            "购买动机": "",
            "过往使用经验及品类态度（需要填充用户之前是否使用波轮洗衣机和滚筒洗衣机；对2个品类的态度如何？）": "",
            "波轮洗衣机的定位": ""
        }
    },
    "B. 波轮洗衣机购买全链路还原": {
        "12、购买过程": {
            "品牌对比": "",
            "品牌态度": "",
            "卖点感知": "",
            "价格": "",
            "溢价考虑": "",
            "外观": "",
            "屏幕与操控方式": "",
            "尺寸": "",
            "容量": "",
            "洗涤程序": "",
            "功能键": "",
            "洗净比": "",
            "转速": "",
            "防缠绕": "",
            "能耗等级": "",
            "耗电量、耗水量": "",
            "噪音": "",
            "电机": "",
            "除菌/除螨方式": "",
            "水流": "",
            "筒自洁": "",
            "售后/质保": "",
            "智能化": "",
            "促销活动": "",
            "其它": "",
            "线下对比": ""
        },
        "13、购买决策": {
            "购买决策因素（KBF）": "",
            "性能排序": "",
            "购买渠道": "",
            "最终购买原因": "",
            "购买障碍": ""
        },
        "14、信息搜索路径还原": {
            "决策时长": "",
            "信息搜索路径": "",
            "传统电商类内容关注": "",
            "电商详情页偏好": "",
            "电商直播偏好": "",
            "社媒内容关注": "",
            "KOL关注": "",
            "购买过程回忆": "",
            "社媒直播偏好": ""
        }
    },
    "C. 年轻人衣物洗干全场景洞察": {
        "15、日常穿着习惯（家访前小问卷数据导入）": {
            "衣物类型": "",
            "服饰购买价格上下限": ""
        },
        "16、衣物洗护习惯": {
            "衣物洗护主要负责人": "",
            "洗衣频率": "",
            "洗衣时间": "",
            "不同材质衣服的习惯": "",
            "不同成员洗涤习惯": "",
            "特殊衣物洗涤习惯": "",
            "非衣服类洗涤物品": "",
            "送外洗衣习惯": "",
            "洗护困难衣物": "",
            "洗护方式-手洗/干洗": "",
            "护理习惯": ""
        },
        "17、机洗习惯": {
            "洗衣流程回顾": "",
            "预洗习惯": "",
            "浸泡习惯": "",
            "手动调参数习惯": "",
            "智能操控习惯": "",
            "存放脏衣服": "",
            "分-衣物分类习惯及痛点": "",
            "投-洗涤剂投放习惯及痛点": "",
            "选-程序选择习惯及投放": "",
            "脱-单独脱水习惯及痛点": "",
            "干-干衣方式": "",
            "清-洗衣机/干衣机清洗及维护习惯及痛点": ""
        }
    },
    "D. 产品使用及满意度评价": {
        "18、产品使用评价": {
            "综合打分": "",
            "使用效果": "",
            "不满意原因": "",
            "操作体验": ""
        },
        "19、深度评价": {
            "产品使用爽点": "",
            "产品使用痛点": ""
        },
        "20、产品推荐度": {
            "推荐度": "",
            "如何推荐": ""
        },
        "21、互动型访谈": {
            "摆放位置考虑": "",
            "使用体验-外观": "",
            "使用体验-内筒": "",
            "使用体验-上开盖操作": "",
            "操作使用体验": "",
            "预约程序": "",
            "特殊程序": "",
            "程序时长": ""
        },
        "22、升级测试-理想洗衣机": {
            "理想洗衣机": "",
            "智能化操控": ""
        }
    },
    "F. 探索 Leader 品牌 & 产品升级机会": {
        "23、Leader品牌&产品升级机会": {
            "非Leader用户-品牌知名度/认知度": "",
            "非Leader用户-品牌印象": "",
            "非Leader用户-品牌美誉": "",
            "非Leader用户-Leader购买障碍": "",
            "Leader用户-品牌印象": "",
            "Leader用户-品牌美誉": "",
            "Leader用户-品牌忠诚": "",
            "所有用户-年轻品牌特征": "",
            "所有用户-品牌期待": "",
            "所有用户-产品期待": "",
            "所有用户-价格期待": "",
            "所有用户-营销期待": "",
            "【客户两个产品外观测试】": "",
            "【客户补问家中最满意的电器】": ""
        }
    },
    "总结标签": {
        "总结标签": {
            "人群标签": '',
            "购买特征标签": '',
            "使用标签": '',
        }
    }
}


def get_extract_prompt(rt):
    example = {
        "A. 年轻人生活状态探讨": {
            "1、受访者": {
                "城市": "成都"
            },
        },
        "B. 波轮洗衣机购买全链路还原": {
            "12、购买过程": {
                "外观": "外观不在意，不拿来选美；材质要求不高"
            }
        }
    }
    extract_prompt = f'''你是一个信息提取大师，你会根据提供的标签和对应的访谈内容，提取出相应的信息。其中访谈内容, 包括了笔录和相应的表格记录, 你会根据提供的内容, 收集信息, 并以要求的 json 格式进行输入。
以下是你需要搜集的标签信息，其中包括了一级标签和一级标签下面的二级标签:
{json.dumps(level_label, indent=4, ensure_ascii=False)}

请你根据提供访谈的信息或相关的表格, 收集需要搜集的内容,并以json格式进行输出,。
例如你发现了 "A. 年轻人生活状态探讨" 的 "1、受访者" 中二级标签 "城市" 是 “成都”, 并且"B. 波轮洗衣机购买全链路还原" 中 "12、购买过程" 中 "外观" 是 “外观不在意，不拿来选美；材质要求不高”，
你只输出下面的json内容即可
{json.dumps(example, indent=4, ensure_ascii=False)}

注意：没搜集到的内容不用输出，只输出搜集到的确切的内容，并且确保输出的json中的标签和提供的标签内容与格式保持一致，如果什么都没搜集到直接输出空json串即可。

下面是一些访谈的信息或相关的表格:
{rt}
你的输出'''

    return extract_prompt
